# 1. Напишите программу, которая принимает на вход вещественное число
# и показывает сумму его цифр.
# 6782 -> 23
# 0,56 -> 11



# num = float(input('Введите число: '))
# sum = 0
# while num != int(num):
#     num = num*10
# print(num)
# while num != 0:
#     ost = num % 10
#     sum +=ost
#     num = num // 10
# print(sum)




# 2. Задайте список из n чисел последовательности (1 + 1/n)^n. Вывести в консоль
# сам список и сумму его элементов.

# number = int(input('Введите число: '))
# my_list = []
# for n in range(1, number+1):
#     my_list.append(f'{n}: {(1+1/n)**n}')
# print(my_list)






# 3. Реализуйте алгоритм перемешивания списка. Встроенный алгоритм SHUFFLE
# не использовать! Реализовать свой метод
